# id используемых эмодзи
emoji = {
    "rich": 954894281972277319,
    "norm": 954894246303920149,
    "poor": 954894194537811988,
    "techno": 954886667557285908,
    "south": 954886483817426954,
    "north": 954886438233710664
}
# Группа названий кнопок расы
group_lbl_button_nation = ['Северяне', 'Южнане', 'Техно-гики']
# Группа названий кнопок происхождения
group_lbl_button_origin = ['Богатая семья', 'Обычная семья', 'Бедность']
# Прочее
TOKEN = "NTY3MzMyNTU5NDc5MTExNzQw.XLR_ng.zhaxoAo_6ZL-LfA5gBEZXPAfGj0"
PREFIX = "/"
